recept/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>InformationRegister.СтатусПродукции</registerRecords>
  <registerRecords>InformationRegister.СведенияВПродукцииИзСчетов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>InformationRegister.СтатусОбеспеченияЗаказа</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьМатериалов</registerRecords>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНакладной</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгрузка</name>
    <type>
      <types>EnumRef.СтатусыЗаказаКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Покупатели</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбеспеченияЗаказа</name>
    <type>
      <types>EnumRef.СтытусОбеспеченияЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПокупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.СтатусыГотовностиПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Продано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Потребность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипНоменклатуры</name>
      <type>
        <types>EnumRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Documents/РасходнаяНакладная/Forms/ФормаЗагрузкиДокументовИзБП/Module.bsl
&НаКлиенте
Процедура ОтобратьДокументы(Команда)
	ОтобратьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтобратьДокументыНаСервере()  
	
    Логин                   = "ВыгрузкаИзБП";   //ЭтаФорма.ЛогинВБП;
    Пароль                  = "gpDcO4N30TVyz4ixHeML";           //ЭтаФорма.ПарольВБП;
    КластерСерверов         = "192.168.1.100";
    ИмяИнформационнойБазы	= "acc";  
    
    Попытка
    	дб 		= Новый COMОбъект("V83.ComConnector");  
    	база 	= дб.Connect("Srvr="""+КластерСерверов+""";Ref="""+ИмяИнформационнойБазы+""";Usr="""+Логин+""";Pwd="""+Пароль+""";");
    	//Сообщить("Успех!");
    Исключение
    	Сообщить("Нет соединения");
    КонецПопытки; 
	
	ПоступлениеБП = база.Документы.СчетНаОплатуПокупателю.Выбрать(НачалоДня(Объект.НачалоПериода), КонецДня(Объект.КонецПериода));
	
	ТЗДок.Очистить();
	Пока ПоступлениеБП.Следующий() Цикл	
			Если НЕ ПоступлениеБП.DeletionMark Тогда 
				нд 					= ТЗДок.Добавить();
				нд.Выбран 			= Ложь;
				нд.Номер			= ПоступлениеБП.Номер;
				нд.Дата 			= ПоступлениеБП.Дата;
				нд.Контрагент 		= база.XMLСтрока(ПоступлениеБП.Контрагент.Наименование); 
				//	нд.Ответственный	= ПоступлениеБП.Ответственный;
				нд.Ссылка			= Документы.РасходнаяНакладная.НайтиПоНомеру(ПоступлениеБП.Номер, ПоступлениеБП.Дата);
		        Если  ЗначениеЗаполнено(ПоступлениеБП.Контрагент.ИНН) Тогда
					нд.ИНН 			= база.XMLСтрока(ПоступлениеБП.Контрагент.ИНН);
				Иначе
					нд.ИНН 			= база.XMLСтрока(ПоступлениеБП.Контрагент.НалоговыйНомер); 
				КонецЕсли;
			КонецЕсли;
	КонецЦикла;	

 КонецПроцедуры

&НаКлиенте
 Процедура ЗагрузитьВБазу(Команда)
	 ЗагрузитьВБазуНаСервере();
 КонецПроцедуры

&НаСервере
 Процедура ЗагрузитьВБазуНаСервере()
	 
    Логин                   = "ВыгрузкаИзБП";
    Пароль                  = "gpDcO4N30TVyz4ixHeML";
    КластерСерверов         = "192.168.1.100";
    ИмяИнформационнойБазы	= "acc";  
    
    Попытка
    	дб 		= Новый COMОбъект("V83.ComConnector");  
    	база 	= дб.Connect("Srvr="""+КластерСерверов+""";Ref="""+ИмяИнформационнойБазы+""";Usr="""+Логин+""";Pwd="""+Пароль+""";");
    Исключение
    	Сообщить("Нет соединения");
    КонецПопытки; 

	
	Для Каждого строка из ТЗДок Цикл 
		Если строка.Выбран Или строка.Резерв Тогда
			ДокБП = база.Документы.СчетНаОплатуПокупателю.НайтиПоНомеру(строка.Номер, строка.Дата);
			Если ЗначениеЗаполнено(строка.Ссылка) Тогда
				Сообщить("Пропущен "+ строка.Номер);
			Иначе 
				строка.Ссылка = РаботаСоСправочниками.СоздатьДокументРеализации(ДокБП, строка.Резерв);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

 КонецПроцедуры

&НаКлиенте
 Процедура ТЗДокВыбранПриИзменении(Элемент)
	 СтрокаТабличнойЧасти = Элементы.ТЗДок.ТекущиеДанные;
	 СтрокаТабличнойЧасти.Резерв = Ложь;
 КонецПроцедуры

&НаКлиенте
 Процедура ТЗДокРезервПриИзменении(Элемент)
	 СтрокаТабличнойЧасти = Элементы.ТЗДок.ТекущиеДанные;
	 СтрокаТабличнойЧасти.Выбран = Ложь;
 КонецПроцедуры
